perf-reports/baseline/dashboard-load.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: /home/ubuntu/repos/timesheet-app/k6/dashboard-load.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 1m10s max duration (incl. graceful stop):
              * default: Up to 50 looping VUs for 40s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/50 VUs, 4 complete and 0 interrupted iterations
default   [   2% ] 01/50 VUs  01.0s/40.0s

running (0m02.0s), 02/50 VUs, 8 complete and 0 interrupted iterations
default   [   5% ] 02/50 VUs  02.0s/40.0s

running (0m03.0s), 03/50 VUs, 15 complete and 0 interrupted iterations
default   [   7% ] 03/50 VUs  03.0s/40.0s

running (0m04.0s), 04/50 VUs, 18 complete and 0 interrupted iterations
default   [  10% ] 04/50 VUs  04.0s/40.0s

running (0m05.0s), 05/50 VUs, 24 complete and 0 interrupted iterations
default   [  12% ] 05/50 VUs  05.0s/40.0s

running (0m06.0s), 06/50 VUs, 30 complete and 0 interrupted iterations
default   [  15% ] 06/50 VUs  06.0s/40.0s

running (0m07.0s), 07/50 VUs, 35 complete and 0 interrupted iterations
default   [  17% ] 07/50 VUs  07.0s/40.0s

running (0m08.0s), 08/50 VUs, 39 complete and 0 interrupted iterations
default   [  20% ] 08/50 VUs  08.0s/40.0s

running (0m09.0s), 09/50 VUs, 45 complete and 0 interrupted iterations
default   [  22% ] 09/50 VUs  09.0s/40.0s

running (0m10.0s), 09/50 VUs, 49 complete and 0 interrupted iterations
default   [  25% ] 09/50 VUs  10.0s/40.0s

running (0m11.0s), 11/50 VUs, 54 complete and 0 interrupted iterations
default   [  27% ] 11/50 VUs  11.0s/40.0s

running (0m12.0s), 13/50 VUs, 57 complete and 0 interrupted iterations
default   [  30% ] 13/50 VUs  12.0s/40.0s

running (0m13.0s), 15/50 VUs, 64 complete and 0 interrupted iterations
default   [  32% ] 15/50 VUs  13.0s/40.0s

running (0m14.0s), 17/50 VUs, 65 complete and 0 interrupted iterations
default   [  35% ] 17/50 VUs  14.0s/40.0s

running (0m15.0s), 19/50 VUs, 73 complete and 0 interrupted iterations
default   [  37% ] 19/50 VUs  15.0s/40.0s

running (0m16.0s), 21/50 VUs, 79 complete and 0 interrupted iterations
default   [  40% ] 21/50 VUs  16.0s/40.0s

running (0m17.0s), 23/50 VUs, 83 complete and 0 interrupted iterations
default   [  42% ] 23/50 VUs  17.0s/40.0s

running (0m18.0s), 25/50 VUs, 89 complete and 0 interrupted iterations
default   [  45% ] 25/50 VUs  18.0s/40.0s

running (0m19.0s), 27/50 VUs, 94 complete and 0 interrupted iterations
default   [  47% ] 27/50 VUs  19.0s/40.0s

running (0m20.0s), 29/50 VUs, 95 complete and 0 interrupted iterations
default   [  50% ] 29/50 VUs  20.0s/40.0s

running (0m21.0s), 31/50 VUs, 98 complete and 0 interrupted iterations
default   [  52% ] 31/50 VUs  21.0s/40.0s

running (0m22.0s), 33/50 VUs, 108 complete and 0 interrupted iterations
default   [  55% ] 33/50 VUs  22.0s/40.0s

running (0m23.0s), 35/50 VUs, 114 complete and 0 interrupted iterations
default   [  57% ] 35/50 VUs  23.0s/40.0s

running (0m24.0s), 37/50 VUs, 118 complete and 0 interrupted iterations
default   [  60% ] 37/50 VUs  24.0s/40.0s

running (0m25.0s), 39/50 VUs, 123 complete and 0 interrupted iterations
default   [  62% ] 39/50 VUs  25.0s/40.0s

running (0m26.0s), 41/50 VUs, 131 complete and 0 interrupted iterations
default   [  65% ] 41/50 VUs  26.0s/40.0s

running (0m27.0s), 43/50 VUs, 133 complete and 0 interrupted iterations
default   [  67% ] 43/50 VUs  27.0s/40.0s

running (0m28.0s), 45/50 VUs, 136 complete and 0 interrupted iterations
default   [  70% ] 45/50 VUs  28.0s/40.0s

running (0m29.0s), 47/50 VUs, 140 complete and 0 interrupted iterations
default   [  72% ] 47/50 VUs  29.0s/40.0s

running (0m30.0s), 49/50 VUs, 148 complete and 0 interrupted iterations
default   [  75% ] 49/50 VUs  30.0s/40.0s

running (0m31.0s), 50/50 VUs, 155 complete and 0 interrupted iterations
default   [  77% ] 50/50 VUs  31.0s/40.0s

running (0m32.0s), 50/50 VUs, 157 complete and 0 interrupted iterations
default   [  80% ] 50/50 VUs  32.0s/40.0s

running (0m33.0s), 50/50 VUs, 164 complete and 0 interrupted iterations
default   [  82% ] 50/50 VUs  33.0s/40.0s

running (0m34.0s), 50/50 VUs, 167 complete and 0 interrupted iterations
default   [  85% ] 50/50 VUs  34.0s/40.0s

running (0m35.0s), 50/50 VUs, 173 complete and 0 interrupted iterations
default   [  87% ] 50/50 VUs  35.0s/40.0s

running (0m36.0s), 48/50 VUs, 181 complete and 0 interrupted iterations
default   [  90% ] 48/50 VUs  36.0s/40.0s

running (0m37.0s), 46/50 VUs, 184 complete and 0 interrupted iterations
default   [  92% ] 46/50 VUs  37.0s/40.0s

running (0m38.0s), 43/50 VUs, 191 complete and 0 interrupted iterations
default   [  95% ] 43/50 VUs  38.0s/40.0s

running (0m39.0s), 43/50 VUs, 191 complete and 0 interrupted iterations
default   [  97% ] 43/50 VUs  39.0s/40.0s

running (0m40.0s), 36/50 VUs, 199 complete and 0 interrupted iterations
default   [ 100% ] 36/50 VUs  40.0s/40.0s

running (0m41.0s), 30/50 VUs, 205 complete and 0 interrupted iterations
default ↓ [ 100% ] 36/50 VUs  40s

running (0m42.0s), 25/50 VUs, 210 complete and 0 interrupted iterations
default ↓ [ 100% ] 36/50 VUs  40s

running (0m43.0s), 18/50 VUs, 217 complete and 0 interrupted iterations
default ↓ [ 100% ] 36/50 VUs  40s

running (0m44.0s), 16/50 VUs, 219 complete and 0 interrupted iterations
default ↓ [ 100% ] 36/50 VUs  40s

running (0m45.0s), 16/50 VUs, 219 complete and 0 interrupted iterations
default ↓ [ 100% ] 36/50 VUs  40s

running (0m46.0s), 15/50 VUs, 220 complete and 0 interrupted iterations
default ↓ [ 100% ] 36/50 VUs  40s

     ✓ clients 200
     ✓ work-entries 200

     checks.........................: 100.00% 470 out of 470
     data_received..................: 2.5 GB  53 MB/s
     data_sent......................: 70 kB   1.5 kB/s
     http_req_blocked...............: avg=43.72µs  min=1µs      med=4.35µs   max=1.21ms   p(90)=167.45µs p(95)=177.08µs p(99)=332.49µs
     http_req_connecting............: avg=30.2µs   min=0s       med=0s       max=1.17ms   p(90)=115.44µs p(95)=125.47µs p(99)=285.51µs
   ✗ http_req_duration..............: avg=5.01s    min=1.42ms   med=3.56s    max=24.33s   p(90)=16.25s   p(95)=20.41s   p(99)=22.82s  
       { expected_response:true }...: avg=5.01s    min=1.42ms   med=3.56s    max=24.33s   p(90)=16.25s   p(95)=20.41s   p(99)=22.82s  
   ✓ http_req_failed................: 0.00%   0 out of 470
     http_req_receiving.............: avg=176.56ms min=16.45µs  med=1.32ms   max=3.37s    p(90)=698.27ms p(95)=1.38s    p(99)=2.3s    
     http_req_sending...............: avg=17.46µs  min=3.83µs   med=13.4µs   max=68.89µs  p(90)=36.58µs  p(95)=44.63µs  p(99)=52.97µs 
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     http_req_waiting...............: avg=4.84s    min=1.34ms   med=3.47s    max=24.04s   p(90)=16.25s   p(95)=20.12s   p(99)=21.99s  
     http_reqs......................: 470     10.029842/s
     iteration_duration.............: avg=5.34s    min=175ms    med=3.98s    max=24.33s   p(90)=15.93s   p(95)=21.34s   p(99)=22.66s  
     iterations.....................: 235     5.014921/s
     payload_bytes..................: avg=10502528 min=10502528 med=10502528 max=10502528 p(90)=10502528 p(95)=10502528 p(99)=10502528
     vus............................: 15      min=1          max=50
     vus_max........................: 50      min=50         max=50


running (0m46.9s), 00/50 VUs, 235 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/50 VUs  40s